[
  {
    "path": "posts/2021-09-12-o-odpowiedzialnoci-za-czyny-w-dobie-lotw-na-marsa/",
    "title": "O odpowiedzialności za czyny w dobie lotów na Marsa",
    "description": "Opowieść o wolnej woli",
    "author": [
      {
        "name": "Szymon Mąka",
        "url": {}
      }
    ],
    "date": "2021-09-12",
    "categories": [
      "Refleksja"
    ],
    "contents": "\r\n\r\nContents\r\nBezwolne maszyny\r\nZłudzenie konieczne\r\nNie ma odpowiedzialności, nie ma kary\r\nEpilog\r\n\r\nW Polsce (i na świecie) nie brakuje przykładów postaw społecznych sprzecznych współczesnej wiedzy naukowej. Za przykład mogą posłużyć postawy anty-GMO, anty-szczepieniowe, katastrofa klimatyczna, które są prawdopodobnie najbardziej znane. Jednak poza nimi wiele aspektów państwa i społeczeństwa funkcjonuje “obok” refleksji naukowej. Przyjrzyjmy się mniej popularnemu zagadnieniu - problematyce wolnej woli.\r\nBezwolne maszyny\r\nW XIX wieku fizyka święciła triumfy, zwłaszcza w dziedzinach elektryczności i magnetyzmu. Émilie du Châtelet i James Joule niezależnie sformułowali zasadę zachowania energii. Michael Faraday odkrył zjawisko indukcji elektromagnetycznej, Georg Ohm opisał związek pomiędzy natężeniem a napięciem prądu elektrycznego. James Maxwell połączył elektryczność i magnetyzm w jedną dziedzinę - elektromagnetyzm. Emil du Bois-Reymond odkrył, że informacja w układzie nerwowym przekazywana jest przez sygnały elektryczne. XIX wiek obfitował również w nowe wynalazki powstałe dzięki rozwijającej się wiedzy, m.in.: oświetlenie elektryczne, kolej parowa, telegram, telefon czy pierwsze aparaty fotograficzne.\r\nNiezwykłe dokonania naukowe oraz zdolność fizyki do dokładnego przewidywania zjawisk przyrodniczych zmusiła współczesnych do refleksji nad naturą rzeczywistości. Według ówczesnej wiedzy, rzeczywistość fizyczna rządzona była przez stałe i uniwersalne prawa fizyki. Znając je i dysponując odpowiednią aparaturą, można było przewidzieć z absolutną dokładnością dowolne zjawisko fizyczne, pomniejszoną tylko o błąd pomiaru.\r\nPopularną metodą rozwiązywania sporów jest rzut monetą. To prosty, a przede wszystkim losowy sposób na decyzję pomiędzy dwoma możliwościami. Jednak zgodnie z prawami fizyki klasycznej, losowość rzutu monetą nie wynika z jakiejś rzeczywistej losowości. Przypadek jest tylko niedostatkiem informacji. Biorąc pod uwagę wszystkie parametry fizyczne: siłę wyrzutu, prędkość kątową, wiatr, grawitację etc, można by obliczyć czy moneta upadnie awersem czy rewersem do dołu. Fizycy twierdzili, że wszystkie zdarzenia w świecie fizycznym, a więc i działanie człowieka, są powiązane związkiem przyczynowo-skutkowym - to znaczy, obecne zdarzenia miały być zdeterminowane przez zdarzenia przeszłe.\r\nPierre-Simon Laplace w roku 1814 dokonał pewnego eksperymentu myślowego: jeśli wyobrazimy sobie istotę - demona, który zna wszystkie obecne parametry fizyczne każdego atomu we wszechświecie, będzie on w stanie przewidzieć wszystko co się zdarzy w przyszłości. Oznaczałoby to, że wszechświat jest całkowicie zdeterminowany, istnieje tylko jedna przyszłość, do której wszyscy zmierzamy, a nasze działania są tylko skutkami zdarzeń z dalekiej przeszłości.\r\nTaki obraz świata nie był przychylny koncepcji wolnej woli - idei ciężkiej do zdefiniowania, a w uproszczeniu oznaczającej, że człowiek, pomijając ograniczenia fizyczne, jest w stanie całkowicie niezależnie decydować o swoich czynach. Jedyną przyczyną jego zachowania jest świadoma decyzja,która sama nie ma przyczyny - przynajmniej w świecie fizycznym. Termin ten ma silne ugruntowanie zarówno w tradycji chrześcijańskiej, jak i filozoficznej. Kartezjańska opozycja umysłu i materii na lata zakorzenił się tak w myśli powszechnej jak i naukowej. Obie tradycje odwołują się do niematerialnego bytu - duszy bądź umysłu, który nieograniczony zasadami obejmującymi materię jest zdolny do ‘’wolnej’’ decyzji. Choć współcześnie rzadziej widać odwołania do niematerialnego umysłu, wciąż widać wpływ dualizmu kartezjańskiego np. w opozycji myślenia racjonalnego i emocji (Damasio, 2011). Idea wolnej woli jest dla nas naturalna i większość z nas doświadcza poczucia sprawczości objawiającego się przekonaniem, że to my jesteśmy przyczyną działania np. ruchu ręki.\r\nKoncept wolnej woli krytykowany był również od strony filozoficznej. Artur Schopenhauer zauważył, że ludzie w swojej naiwności dowodzą wolności swej woli twierdząc: “mogę robić co chcę.” Schopenhauer zapytał wtedy: skoro można robić co się chce, czy można chcieć co się chce? Nawet jeśli przyjęlibyśmy odpowiedź twierdzącą, pytanie można rozszerzyć do: „czy można chcieć tego, co chce się chcieć?”. W ten sposób Schopenhauer pokazał, że nie mamy wpływu na nasze ‘’chcenia’’, które są przyczyną naszych działań (Schopenhauer, 1991).\r\nOdkrycie fizyki kwantowej, że rzeczywistość na poziomie subatomowym jest probabilistyczna, zachwiała wiarą w determinizm fizyczny. Była to idea tak niepojęta dla wielu fizyków, że, jak stale powtarza fizyk Andrzej Dragan w swoich wykładach, wielu odkrywców efektów kwantowych nie wierzyło w swoje odkrycia aż do śmierci. Sam problem losowości i determinizmu jest niezwykle ciekawy. Badania wykorzystujące twierdzenie Bella wykazują, że stan kwantowych cząstek splątanych nie wynika z ich historii, tzn. stanu jaki miały wcześniej, lecz w sposób probabilistyczny objawia się podczas pomiaru. Eksperymenty nie dają całkowitej pewności (jak to zwykle bywa w nauce) o istnieniu losowości na kwantowym poziomie. Wynika to z problemów metodologicznych, takich jak: możliwe wady eksperymentu czy niepewności pomiarowe. Niemniej, wyniki tych badań zdają się mocno sugerować prawdziwość postulatów fizyki kwantowej1.\r\nNiektórzy myśliciele dopatrywali się w zjawiskach kwantowych mechanizmów umożliwiających istnienie wolnej woli oraz świadomości. Roger Penrose uważa, że zjawiska kwantowe zachodzące w mózgu generują świadomość. Z kolei Johnjoe McFadden uważa, że za wolną wolę i świadomość odpowiada pole elektromagnetyczne wytwarzane przez pracujący mózg. Należy tu poczynić pewną uwagę. Mechanika kwantowa jest najbardziej podstawową teorią naukową jaką posiadamy, dotyczy zachowania mikrocząstek, z których zbudowane są wszystkie większe obiekty fizyczne i podlegają jej prawom. W takim ujęciu wszystko jest “kwantowe.” Gdy jednak mowa o kwantowych efektach w mózgu, zwykle chodzi o nietrywialne efekty kwantowe takie jak tunelowanie, splątanie czy superpozycja. Efekty te potrzebują odpowiednich warunków do zaistnienia. Obliczenia pokazują, że te efekty kwantowe w mózgu ulegają dekoherencji zbyt szybko, by wpływać lub zarządzać pracą neuronów (Seife, 2000)2. Nawet jeśli dopuścimy pewną losowość w pracy mózgu, problem z wolną wolą pozostał zasadniczo ten sam. Nawet jeśli istnieje pewna losowość w działaniu umysłu, to nie umysł ją generuje. Jeśli decyzja jest dziełem przypadku, nie może być wolna, ponieważ jest przypadkowa. Ponadto pojawia się też pytanie - jak taka losowość miałaby się manifestować. Na poziomie neuronalnym, gdyby losowe neurony losowo generowałyby potencjały czynnościowe, zakłóciłoby to pracę mózgu. Losowość musiałaby być niezwykle precyzyjna. Nie znajdziemy jej jednak też na poziomie świadomym, gdyż ludzie nie są w stanie np. wygenerować losowych sekwencji liczb (Figurska et al., 2008; Schulz et al., 2012).\r\nPoszukiwania kwantowej świadomości przypominają pod pewnymi względami problem homunkulusa. Hipotetyczny homunkulus to mały zarządca w naszym mózgu, który “ogląda” informacje dostarczane przez zmysły, integruje je i podejmuje decyzje. W toku historii wielokrotnie poszukiwano owego homunkulusa czy to w postaci niematerialnej duszy czy jakiegoś konkretnego obszaru w mózgu, który odpowiada za świadomość. Nie odnaleziono jednak niczego takiego, a świadomość wydaje się wyłaniać ze zsynchronizowanej pracy całego mózgu. W naukowym obrazie świata, zawieszeni pomiędzy deterministycznymi i stochastycznymi procesami, nie znajdziemy miejsca dla wolności przez duże “W.”\r\nHomunkulus\r\nProblemem organu zarządczego jest to, że jego działeniem również powinno coś zarządzać, i tak ad infinitum.\r\nZłudzenie konieczne\r\nMimo to, wielu ludzi - w tym naukowców, nie godzi się z takim stanem rzeczy. Doświadczenie sprawczości jest tak potężne, że stanowi samoistny argument za istnieniem wolnej woli. Hannah Arendt pisała “uznaję wewnętrzne świadectwo »ja chcę« za dostateczny dowód realności fenomenu woli” (Arendt, 1996), jakoby samo istnienie subiektywnego poczucia woli byłoby wystarczające, by udowodnić istnienie wolnych decyzji. Mgliste stwierdzenie, że struktura rzeczywistości, w której się znajdujemy, zaprzecza możliwości istnienia takiego fenomenu, może być dla wielu nieprzekonująca, gdy tak żywo czujemy naszą własną sprawczość. Niektórzy myśliciele, by znaleźć empiryczne dowody za lub przeciw wolnej woli, zdecydowali poszukać ich w prężnie rozwijającej się dziedzinie zajmującej się badaniem umysłu - szeroko pojętej neuronauki.\r\nNajsłynniejszymi eksperymentami dotyczącymi wolnej woli są eksperymenty Libeta i później Haynesa, którzy wykazali, że w przypadku prostych decyzji, takich jak naciśnięcie jednego z dwóch guzików, badacz jest w stanie przewidzieć na podstawie aktywności mózgu co wybierze badany, zanim uświadomi on sobie swoją decyzję (Soon et al., 2013). Choć te eksperymenty są najbardziej znane, ponieważ explicite poruszały tematykę wolnej woli, nie znajdziemy wielu badań studiujących wolną wolę. Wydaje się wręcz (pozornie), że na temat wolnej woli neuronauka ma niewiele do powiedzenia. Jest to podyktowane faktem, że na pytanie o wolną wolę (choć nie zostało zadane) została już udzielona odpowiedź. Założenia metodologiczne neuronauk i uzyskana dzięki nim wiedza, spójna z resztą naszej wiedzy o świecie, wykluczają istnienie fenomenu, który by jej jawnie przeczył. Mózg jest tylko (i aż) biologicznym komputerem. Laptop, na którym piszę ten tekst też potrafi podejmować decyzje, niemniej nie posiada z tego tytułu wolnej woli. Wydaje się, że wolna wola jest pojęciem, który ciężko wpisać we współczesną naukę.\r\n\r\nCelowo nie rozwijam problemu świadomości, który, moim zdaniem, jest bardziej skomplikowany niż problematyka wolnej woli. Na szczęście ta ostatnia nie wymaga prób odpowiedzenia na pytanie “czym jest świadomość?”\r\nMózg determinuje nasze decyzje poprzez obliczenia, a owe obliczenia determinowane są przez interakcje genów i środowiska. Bez odwołania do metafizycznych efektów, nie ma miejsca na ów wolny element. Niemniej, filozof Phillipe Meyer w książce “Złudzenie konieczne” zauważa, że chociaż neuronaukowcy udowodnili materialność funkcjonowania mózgu w każdym aspekcie, wielu naukowców, w tym niektórzy neuronaukowcy, odrzucają czysto materialny charakter pracy mózgu i to niekoniecznie w oderwaniu od swojej pracy naukowej (Meyer, 1998). John Eccles, laureat nagrody Nobla z fizjologii i medycyny (za badania nad synapsami), napisał artykuł w którym twierdził, że „[mózg odznacza się] wrażliwością innego rodzaju niż jakikolwiek instrument fizyczny” oraz że „umysł osiąga połączenie z mózgiem za pośrednictwem przestrzennoczasowych pól oddziaływania, które stają się aktywne dzięki tej wyjątkowej […] funkcji pobudzonej kory mózgowej”. Znany neuronaukowiec Michael Gazzaniga tak skomentował poglądy Eccelsa: “No, no! Przecież to czyste wudu, opisane wyszukanym językiem. Eccles zastąpił Kartezjuszową szyszynkę tajemniczą wrażliwością pobudzonej kory mózgowej. Dwieście lat po Kartezjuszu kontynuował kartezjańską tradycję dualizmu, mimo że spędzał sześćdziesiąt godzin tygodniowo na badaniu i rejestrowaniu aktywności neuronów i choć we wszystkich innych sprawach był gorliwym wyznawcą determinizmu. To po prostu niepojęte.” (Gazzaniga, 2020).\r\nWydaje się, że mamy do czynienia tutaj przykładem desperackiej próby ocalenia tego, w co dość długo wierzyliśmy, że nas ludzi wyróżnia. Wspomniany już Kartezjusz wierzył, że zwierzęta są maszynami napędzanymi przez skomplikowane mechanizmy (Descartes, 1980). Nie chciał jednak dopuścić, że podobnie może być w wypadku ludzi. Mimo oporów wobec materialistycznych i mechanicystycznych wyjaśnień działania ludzkiego umysłu, neuronauki zdają się sukcesywnie pokazywać, że nasza świadomość, poczucie sprawczości i ciągłości “ja,” są sprytnymi złudzeniami.\r\nBy zobaczyć jakie problemy nastręcza pojęcie wolnej woli, przyjrzyjmy się kilku badaniom naukowym. Michael Gazzaniga badał pacjentów po komisurotomi - chirurgicznym rozszczepieniu półkul mózgu wykonanym w celu złagodzenia ciężkich ataków epilepsji. W wyniku tego obie półkule dostawały te same dane wejściowe z obszarów podkorowych, ale działają niezależnie od siebie. Półkule nie dzielą informacji wzrokowej, prawe pole widzenia dochodzi tylko do lewej półkuli, a lewe do prawej. Jednocześnie u większości ludzi obszary związane z mową mieszczą się w lewej półkuli, słowa produkowane są bez udziału prawej półkuli. Pozwala to na dostarczanie różnych informacji obu półkulom: “Pokazaliśmy pacjentowi dwa obrazki: w prawej połowie jego pola widzenia umieściliśmy wizerunek kurzej łapy, tak aby lewa półkula mózgu widziała tylko ten obrazek, a w lewej połowie – obraz zaśnieżonego podwórka, tak aby półkula prawa nie widziała niczego poza nim. Następnie położyliśmy przed pacjentem kilkanaście rysunków, widocznych dla obu półkul mózgu, i poprosiliśmy, żeby wybrał spośród nich obrazki kojarzące mu się z tym, co przed chwilą zobaczył. Jego lewa ręka wskazała szuflę (która stanowiła najlepszą odpowiedź na widok zaśnieżonego podwórka), a prawa – kurę (była to najbardziej trafna reakcja na rysunek kurzej łapy). Kiedy zapytaliśmy, dlaczego wybrał właśnie te obrazki, jego ośrodek mowy zlokalizowany w lewej półkuli odparł: „Och, to bardzo proste. Kurza łapa kojarzy mi się z kurą,” z łatwością wyjaśniając to, co wiedział. Zobaczył kurzą łapę. Następnie, spojrzawszy na swoją lewą dłoń wskazującą szuflę, mężczyzna dodał bez wahania: „A szufla jest potrzebna do posprzątania kurnika”[…] Interesujący wydawał się fakt, że lewa półkula nie odpowiedziała: „Nie wiem”, co byłoby zgodne z prawdą. Zamiast tego wymyśliła odpowiedź pasującą do sytuacji. Konfabulowała, składając informacje, którymi dysponowała, w sensowną odpowiedź. Nazwaliśmy ten lewopółkulowy proces interpretatorem.\" (Gazzaniga, 2013)\r\nGazzaniga kontynuował badania nad interpretatorem. Jest to moduł wyspecjalizowany w tworzeniu spójnej narracji, umożliwia również tworzenie abstrakcyjnych relacji przyczynowo-skutkowych. Pozwala, na podstawie różnych przesłanek, wyciągać logiczne wnioski, wychodzące poza czystą percepcję rzeczywistości. Lewopółkulowy interpretator nieustannie szuka potencjalnych przyczyn różnych zdarzeń, jednak struktura, znajdująca się prawdopodobnie w prawym płacie ciemieniowym, hamuje działanie interpretatora, kiedy ten zaczyna tworzyć historie zbytnio odstające od rzeczywistości. Gdy półkule są rozdzielone, sygnał hamujący nie dochodzi do lewej półkuli, a interpretator może nieskrępowanie snuć swoje historie. Prowadzi to do systematycznych konfabulacji pacjentów z rozdzielonymi półkulami, ponieważ nawet najmniej prawdopodobne wyjaśnienia dostają się do świadomości jako wiarygodne przyczyny. Przykładowo, gdy Gazzaniga zaprezentował prawej półkuli pacjentki przerażający film, ta zaaktywizowała układ współczulny, wprowadzając fizjologiczną reakcję strachu - przyśpieszone bicie serca, potliwość i aktywność mięśniową. Ponieważ obszary podkorowe przekazują informacje o aktywności układu współczulnego prawej i lewej półkuli, lewa półkula “wiedziała,” że organizm jest przestraszony, nie wiedziała jednak dlaczego. Interpretator na podstawie dostępnych informacji - obecności Gazzanigi w pomieszczeniu - natychmiast wytworzył wyjaśnienie tego stanu: to doktor Gazzaniga jest przerażający.\r\nDalsza praca zespołu Gazzanigi pokazała role lewopółkulowego interpretatora u ludzi zdrowych. Sprawia on, że mamy poczucie spójnej narracji w naszych działaniach. Interpretator jest jednak tak dobry jak informacje, które do niego docierają, a wyniki eksperymentów pokazują, że docierają do niego rezultaty, czy też wyniki działań innych modułów mózgu, nie ma on jednak dostępu do ich obliczeń. Przykładem jest coś, co nazywamy pamięcią procesualną. W odróżnieniu do pamięci deklaratywnej, czyli takiej, do której mamy świadomy dostęp, pewne czynności potrafimy wykonywać doskonale, ale nie jesteśmy właściwie w stanie wytłumaczyć jak to robimy. Przykładem może być jazda na rowerze. Wyjaśnienie komuś jak należy jeździć na rowerze jest skazane na porażkę. Jest to wbrew pozorom bardziej skomplikowane niż pedałowanie i kręcenie kierownicą. Wymaga poczucia równowagi i odpowiedniego balansowania ciałem. Jednak osoby, które potrafią jeździć na rowerze wcale nie czują, by coś takiego robiły.\r\nInnym przykładem może być wiedza ekspercka. Ludzie specjalizujący się w pewnych zadaniach, potrafiący wykonywać je z niesamowitą biegłością, często nie mają wglądu w to jak to robią. Gazzaniga zaprosił do laboratorium mistrza szachowego Patricka Wolffa, który miał za zadanie odtworzyć układ pionków na szachownicy, oglądając go przez 5 sekund. Wolff był w stanie to zrobić, jeśli układ, który oglądał był sensowny z szachowego punktu widzenia. Jeśli jednak pionki były ustawione losowo, radził sobie z podobną skutecznością jak każdy inny człowiek. Nie miał więc świetnej pamięci wzrokowej, lecz jego moduł zajmujący się grupowaniem percepcyjnym nauczony wieloletnią grą w szachy błyskawicznie rozpoznawał złożone wzorce szachowe. Sam Wolff był tego nieświadomy, nie był w stanie powiedzieć jak udaje mu się osiągnąć dobry wynik w jednym przypadku i przeciętny w drugim. Jego interpretator dostawał tylko informacje o końcowym wyniku (odtworzeniu szachownicy), nie miał jednak informacji jak udało się to osiągnąć.\r\nInformacje przekazywane do świadomości przez mózg są selektywne. Nie wszystko co mózg zauważy i przetworzy dostanie się do naszej świadomości, czy też jakby powiedział Gazzaniga, do interpretatora. Jeśli badanym zostanie zaprezentowana przez kilka-kilkanaście milisekund przestraszona twarz, badani jej świadomie nie zauważą, jednak dostrzeżemy zwiększoną aktywność ciała migdałowatego - struktury przetwarzającej bodźce zagrażające (Whalen et al., 1998). Jest to kolejny z przykładów, że nie mamy świadomego dostępu do pewnych informacji przetwarzanych przez nasz mózg.\r\nMożna powiedzieć, że mózg regularnie nas “oszukuje.” Jeśli dotkniemy palcem do nosa, jednocześnie poczujemy dotyk w nosie i w palcu, mimo że sygnał z palca dotrze do mózgu znacznie później. Mózg tworzy własną reprezentację czasu przekazywaną świadomości. Badani, u których po wykonaniu spontanicznej akcji zaaplikowano silny impuls magnetyczny na pole przedruchowe, postrzegali, że intencja wykonania ruchu pojawiła się wcześniej niż gdy nie otrzymali impulsu (Lau et al., 2007).\r\nSposób przetwarzania informacji przez mózg ma krytyczne znaczenie nie tylko dla postrzegania sprawczości u siebie samych, ale i u innych ludzi. Zespół Rebecki Saxe zakłócił badanym działanie pewnego obszaru mózgu - prawego styku skroniowo-ciemieniowego, za pomocą impulsu magnetycznego. Następnie przedstawiła im cztery historie, w których Grace podała swojemu przyjacielowi cukierniczkę myśląc, że jest tam cukier/trucizna, gdy naprawdę był tam cukier/trucizna. Badani, którzy nie otrzymali impulsu, negatywnie oceniali Grace, gdy ta myślała, że w cukierniczce jest trucizna, niezależnie od tego czy faktycznie tam była. Badani którzy impuls otrzymali, łagodniej oceniali Grace, gdy ta myśląc, że podaje truciznę, podała cukier (Young et al., 2010). Badani, u których praca styku skroniowo-ciemieniowego została zakłócona, skupiali się na skutkach działań Grace, nie biorąc pod uwagę jej intencji. Prawy styk ciemieniowo-skroniowy jest częścią obwodu nerwowego zajmującego się teorią umysłu - zdolnością pozwalającą między innymi na przejęcie perspektywy innych osób. Sposób w jaki badani dokonują oceny moralnej Grace zależy od pracy tego obwodu. Gdyby mieli zadecydować czy i jaką karę wymierzyć Grace, informacje przetwarzane przez styk skroniowo-ciemieniowy miałby spore znaczenie dla tej decyzji.\r\nNie ma odpowiedzialności, nie ma kary\r\nPowyższe przykłady miały za zadanie pokazać, że odczuwana przez nas rzeczywistość jest sprytną iluzją, która nie zawsze przystaje do rzeczywistości fizycznej. Choć najbardziej spektakularnie widać to u ludzi z uszkodzeniami mózgu, postrzeganie ludzi “zdrowych” też jest wynikiem pracy mózgu, pracy niezależnej od nas samych. Wydaje się, że taki brutalny mechanicyzm odziera świat z jakiegokolwiek sensu. Jednak wiedza o tym, że “wolna wola” nie istnieje, raczej nie zmieni sposobu w jaki zachowujemy się na co dzień. Ma to jednak znaczenie dla praktyk społecznych. Jednym z przykładów może jest system penitencjarny. System penitencjarny stawia sobie różne cele: odizolowanie jednostek niebezpiecznych od reszty społeczeństwa, resocjalizacji czy karze. Kara opiera się na pojęciu odpowiedzialności, jest odpłatą (sankcjonowaną zemstą) za przestępstwo.\r\nOkoło 180 lat temu stworzono regułę M’Naghtena - precyzyjne pojęcie niepoczytalności. Stało się to podczas procesu Daniela M’Naghtena w Wielkiej Brytanii, oskarżonego o zabójstwo i uniewinnionego z powodu choroby psychicznej. Wyrok ten wywołał ogromne kontrowersje, w wyniku czego powołano komisję, która miała określić dokładne kryteria niepoczytalności. Osoba, która nie jest świadoma, że popełnia przestępstwo, nie wie, że to co zrobiła jest “złe” w chwili popełnienia czynu nie może podlegać karze. Był to przełom społeczny, zdecydowano bowiem, że istnieją wyjątki od odpowiedzialności (Maroń, 2018).\r\n\r\nNie był to jednak pierwszy wyrok biorący pod uwagę poczytalność sprawcy. Istniał precedens (Rex v. Arnold z 1724) zwany “standardem dzikiej bestii,” jednak dopiero po sprawie M’Naghtena zestandaryzowano wskaźniki niepoczytalności.\r\nIdea ta, choć z oporem, na stałe zagościła w zachodnich systemach prawnych. Powoli pojawiła się w innych obszarach społecznych - sto pięćdziesiąt lat po sprawie M’Naghtena Kościół Katolicki - dla którego pojęcie wolnej woli i odpowiedzialności za czyny są niezwykle ważne, również uznał owy argument. Jak możemy przeczytać w Katechizmie: “Ciężkie zaburzenia psychiczne, strach lub poważna obawa przed próbą, cierpieniem lub torturami mogą zmniejszyć odpowiedzialność samobójcy” (Katechizm Kościoła Katolickiego, 2015), uznając, że depresja zmniejsza opdowiedzialnośc za czyn uważany jako grzech ciężki.\r\nChoć ówcześnie idea, że człowiek może nie odpowiadać za swoje czynny była myślą nowatorską, funkcjonuje do dziś w stanie praktycznie nie zmienionym, mimo znacznego postępu nauki. Znaleźliśmy się współcześnie w miejscu, gdzie dzielimy ludzi na zdolnych i tych niezdolnych do odpowiedzialności. Kryterium rozróżnienia polega na poprawności funkcjonowania mózgu. Problem w tym, że według wiedzy neuronaukowej ciężko jest mówić o odpowiedzialności kogokolwiek (Farah, 2005). Przytoczone wcześniej przykłady miały pokazać, że zachowanie zależne jest od pracy mózgu, na którą jednostka nie ma wpływu. Neurobiolog Robert Sapolsky poddał pod wątpliwość obecną definicje niepoczytalności skupiającą się na nieświadomości sprawcy, że popełnia czyn zabroniony. Istotnym zespołem ośrodków mózgów odpowiedzialnych za hamowanie zachowań impulsywnych jest kora przedczołowa. Osoby z zaburzonym jej funkcjonowaniem doskonale zdają sobie sprawę z swoich zachowań, nie są jednak w stanie się od nich powstrzymać (Sapolsky, 2006).\r\nWśród wielu neuronaukowców i przedstawicieli innych dziedzin istnieje pogląd, że kara oparta na odpowiedzialności, która jest sankcjonowaną prawnie zemstą, jest co najmniej wątpliwa. Richard Dawkins stwierdził “Odpłata jako zasada moralna jest niezgodna z naukowym poglądem na ludzkie zachowanie. Jako naukowcy wierzymy, że ludzkie mózgi, chociaż mogą nie działać w taki sam sposób, jak komputery stworzone przez człowieka, są tak samo rządzone prawami fizyki. Kiedy komputer działa nieprawidłowo, nie karzemy go. Odnajdujemy problem i naprawiamy go, zwykle poprzez wymianę uszkodzonego komponentu, sprzętowego lub programowego” (Dawkins, 2006). Joshua Green i Jonathan Cohen uważają, że należy odrzucić koncept retrybucji, a zamiast tego skupić się na odseparowaniu od społeczeństwa (jeśli to potrzebne) i resocjalizacji. Postulują, że wraz ze zrozumieniem przyczyn działań przestępców, powinniśmy zmienić stosunek do nich (Greene & Cohen, 2004). Jest to logiczną konsekwencją faktu, że retrybucje wobec osób psychicznie chorych uważamy za niehumanitarne (ponieważ nie mają wpływu na to co robią), to zgodnie z wiedzą neuronaukową nie powinniśmy stosować retrybucji wobec nikogo.\r\nNiekoniecznie jednak brak “wolnej woli” człowieka implikuje konieczność zrezygnowania z retrybucyjnej funkcji kary. Psychiatra Sally Satel i psycholog Scott O. Lilienfeld w książce “Pranie mózgu” argumentują, że niezależnie od statusu wolnej woli, ludzie mają poczucie wolności wyboru i działają podług niego, a kara ma ewolucyjną funkcję społeczną (Satel & Lilienfeld, 2017). Już małe dzieci odbierają zachowanie innych ludzi w kategoriach intencjonalności i mają silne wrodzone zachowania moralne, włącznie z karaniem źle zachowujących się jednostek (Hamlin, 2013). Eksperymenty przeprowadzone przez ekonomistów behawioralnych pokazały, że wielu ludzi dyscyplinuje jednostki zachowujące się “nie-fair,” nawet jeśli były tylko biernymi obserwatorami takiego zachowania i są w stanie poświęcić na to własne zasoby (Fehr & Fischbacher, 2004). Pozwala to ludziom na osiąganie celów wymagającej współpracy wielu osób i minimalizacji “oszustów.”\r\nPonadto Satel i Lilienfeld przywołują eksperyment psycholożki i prawniczki Kenworthey Bilz, w którym wykazała, że nieukaranie sprawcy gwałtu obniża status społeczny ofiary (Bilz, 2016). Sugerują, że brak moralnego zadośćuczynienia przy użyciu proporcjonalnej kary może prowadzić do zachwiania równowagi społecznej. Przywołują hipotezę “sprawiedliwego świata” sformułowaną przez Melvina Lernera. Jest to błąd poznawczy polegający na tendencji do wiary, że ludzie zasługują na nieszczęścia i sukcesy, które ich spotykają. W eksperymencie przeprowadzonym przez Lernera badani obserwowali aktorkę wykonującą zadanie pamięciowe, jednocześnie otrzymującą bolesne impulsy elektrycznie (udawane, o czym badani nie wiedzieli). Gdy badani mogli zdecydować o przerwaniu eksperymentu lub dowiadywali się, że aktorka otrzyma wynagrodzenie pieniężne oceniali ją znacznie wyżej, niż w sytuacji gdy biernie przyglądali się sytuacji bez możliwości wpływu na nią (Lerner & Miller, 1978). Lerner doszedł do wniosku, że widok osoby cierpiącej, która nie ma szans na rekompensatę skłania ludzi do deprecjonowania ofiary. Satel i Lilienfeld sugerują, że rezygnacja ze sprawiedliwej odpłaty byłaby negatywna w skutkach zarówno dla ofiary jak i moralności społecznej.\r\nInni wyrażają bardziej umiarkowany pogląd, że kwestia wolnej woli jest w gruncie rzeczy nieistotna dla prawa, dostrzegają jednak, że włączenie wiedzy o człowieku do procesu wymierzania sprawiedliwości może poskutkować bardziej empatycznym traktowaniem przestępców (przynajmniej tych o których wiemy, że mają znacznie zakłócone procesy podejmowania decyzji), przy zachowaniu psychologicznej potrzeby retrybucji ofiar i społeczeństwa (Goodenough & Prehn, 2004). Jest to próba pewnego kompromisu, wskazująca na potrzebę zmian w systemie prawnym, niemniej nie polegająca na odrzuceniu retrybucyjnej funkcji kary.\r\nEpilog\r\nChoć odpłata jest głęboko zakorzeniona w ludzkiej kulturze i biologii, nie oznacza to, że nie jesteśmy w stanie zmienić naszego podejścia. Człowiek wielokrotnie wprowadzał zmiany społeczne, jak wówczas mówiono, niezgodne z jego naturą czy uderzające w porządek społeczny. Jeśli jako gatunek mielibyśmy działać tak jak aktualnie postrzegamy rzeczywistość, niewiele byśmy osiągnęli. Green i Cohen podają przykład tego jak nasza percepcja fizycznej rzeczywistości rozmija się z tym jak jest faktycznie. Przykładem może być czas. Czas jest względny, zależny od pola grawitacyjnego i prędkości z jaką układ odniesienia się porusza. Jednak nasze codzienne doświadczenie mówi nam, że czas jest uniwersalny i płynie liniowo. Ma to silne przyczyny ewolucyjne. Czy to oznacza, że jesteśmy na zawsze ograniczeni przez nasze liniowe postrzeganie czasu? Zdecydowanie nie. Wykorzystujemy zdobytą wiedzę w tworzeniu rzeczywistości np. w systemach GPS. Podobnie jest w przypadku omawianego problemu. Możemy wykorzystać wiedzę, którą mamy, by zmienić nasze zachowania społeczne.\r\n\r\n\r\n\r\nArendt, H. (1996). Wola (p. 28). Czytelnik.\r\n\r\n\r\nBilz, K. (2016). Testing the expressive theory of punishment. Journal of Empirical Legal Studies, 13(2), 358–392.\r\n\r\n\r\nDamasio, A. R. (2011). Błąd kartezjusza: Emocje, rozum i ludzki mózg. Dom Wydawniczy\" Rebis\".\r\n\r\n\r\nDawkins, R. (2006). Let’s all stop beating basil’s car. https://www.edge.org/response-detail/11416\r\n\r\n\r\nDescartes, R. (1980). Rozprawa o metodzie (pp. 72–73). Państwowy Instytut Wydawniczy.\r\n\r\n\r\nFarah, M. J. (2005). Neuroethics: The practical and the philosophical. Trends in Cognitive Sciences, 9(1), 34–40.\r\n\r\n\r\nFehr, E., & Fischbacher, U. (2004). Third-party punishment and social norms. Evolution and Human Behavior, 25(2), 63–87.\r\n\r\n\r\nFigurska, M., Stańczyk, M., & Kulesza, K. (2008). Humans cannot consciously generate random numbers sequences: Polemic study. Medical Hypotheses, 70(1), 182–185.\r\n\r\n\r\nGazzaniga, M. S. (2013). Kto tu rządzi-ja czy mój mózg?: Neuronauka a istnienie wolnej woli (pp. 74–76). Smak Słowa.\r\n\r\n\r\nGazzaniga, M. S. (2020). Instynkt świadomości jak z mózgu wyłania się umysł? (pp. 89–90). Smak Słowa.\r\n\r\n\r\nGoodenough, O. R., & Prehn, K. (2004). A neuroscientific approach to normative judgment in law and justice. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences, 359(1451), 1709–1726.\r\n\r\n\r\nGreene, J., & Cohen, J. (2004). For the law, neuroscience changes nothing and everything. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences, 359(1451), 1775–1785.\r\n\r\n\r\nHamlin, J. K. (2013). Moral judgment and action in preverbal infants and toddlers: Evidence for an innate moral core. Current Directions in Psychological Science, 22(3), 186–193.\r\n\r\n\r\nKatechizm kościoła katolickiego. (2015). 2280, 2282.\r\n\r\n\r\nLau, H. C., Rogers, R. D., & Passingham, R. E. (2007). Manipulating the experienced onset of intention after action execution. Journal of Cognitive Neuroscience, 19(1), 81–90.\r\n\r\n\r\nLerner, M. J., & Miller, D. T. (1978). Just world research and the attribution process: Looking back and ahead. Psychological Bulletin, 85(5), 1030.\r\n\r\n\r\nMaroń, G. (2018). Zabójstwo „z rozkazu boga” a niepoczytalność sprawcy w świetle orzecznictwa sądów USA ( murder on the command of god versus a perpetrator’s insanity in the light of the case law of u.s. courts). 2018.\r\n\r\n\r\nMeyer, P. (1998). Złudzenie konieczne (pp. 187–188). Państwowy Instytut Wydawniczy.\r\n\r\n\r\nSapolsky, R. M. (2006). The frontal cortex and the criminal justice system. Law and the Brain, 227.\r\n\r\n\r\nSatel, S., & Lilienfeld, S. O. (2017). Pranie mózgu. Uwodzicielska moc (bezmyślnych) neuronauk (pp. 191–228). CiS.\r\n\r\n\r\nSchopenhauer, A. (1991). O wolności ludzkiej woli (pp. 16–17). bis.\r\n\r\n\r\nSchulz, M.-A., Schmalbach, B., Brugger, P., & Witt, K. (2012). Analysing humanly generated random number sequences: A pattern-based approach. PloS One, 7(7), e41531.\r\n\r\n\r\nSeife, C. (2000). Cold numbers unmake the quantum mind. Science, 287(5454), 791–791.\r\n\r\n\r\nSoon, C. S., He, A. H., Bode, S., & Haynes, J.-D. (2013). Predicting free choices for abstract intentions. Proceedings of the National Academy of Sciences, 110(15), 6217–6222.\r\n\r\n\r\nWhalen, P. J., Rauch, S. L., Etcoff, N. L., McInerney, S. C., Lee, M. B., & Jenike, M. A. (1998). Masked presentations of emotional facial expressions modulate amygdala activity without explicit knowledge. Journal of Neuroscience, 18(1), 411–418.\r\n\r\n\r\nYoung, L., Camprodon, J. A., Hauser, M., Pascual-Leone, A., & Saxe, R. (2010). Disruption of the right temporoparietal junction with transcranial magnetic stimulation reduces the role of beliefs in moral judgments. Proceedings of the National Academy of Sciences, 107(15), 6753–6758.\r\n\r\n\r\nCo interesujące, pojawia się tu dodatkowy problem. W wielu dziedzinach nauki wykorzystujemy założenie o niezależności pomiarów, który uzyskujemy zwykle dzięki np. generatorom liczb pseudolosowych czy podwójnie ślepej próbie. Zwykle to wystarcza by uzyskać rzetelne wyniki. Jeśli jednak chcemy zbadać fundamentalną właściwość jaką jest samo istnienie losowości, nie możemy wykorzystać liczb pseudolosowych do ustawienia parametrów urządzeń, ponieważ liczby pseudolosowe są deterministyczne. Prawdziwą losowość uzyskuje się podczas pomiarów efektów kwantowych, ale tu zakładamy losowość zjawisk kwantowych, by udowodnić losowość zjawisk kwantowych. Fizycy starają się poradzić sobie z tym problemem na wiele sposobów, np. mierząc fotony pochodzące z gwiazd oddalonych o 600 lat świetlnych czy prosząc internautów o głosowanie w wyborze parametrów. Zabezpiecza to przez zarzutem prostego łańcucha deterministycznego, nie wyklucza jednak superdeterminizmu, to znaczy możliwości, że takie, a nie inne zachowanie kwantowych cząsteczek podczas pomiarów wynika z mechanizmu przyczynowo-skutkowego, którego nie rozumiemy. Wykład o twierdzeniu Bella autrostwa Michała Ecksteina - https://www.youtube.com/watch?v=eRDxsl06f30&t=194s↩︎\r\nInteresujący przegląd zagadnień związanych z zjawiskami kwantowymi w biologii można znaleźć w książce Paula Davisa “Demon w maszynie.”↩︎\r\n",
    "preview": "posts/2021-09-12-o-odpowiedzialnoci-za-czyny-w-dobie-lotw-na-marsa/pexels-suzy-hazelwood-1422673.jpg",
    "last_modified": "2021-09-13T09:32:56+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-12-odwied-baz-wiedzy/",
    "title": "Odwiedź Bazę Wiedzy!",
    "description": {},
    "author": [
      {
        "name": "Kamil Kopacewicz",
        "url": {}
      }
    ],
    "date": "2021-09-12",
    "categories": [
      "Sortownia"
    ],
    "contents": "\r\nOdwiedź Bazę Wiedzy!\r\nOtwieramy pierwszy moduł Sortowni Wiedzy! Jest nią… Baza Wiedzy. Sprawa jest bardzo prosta – zbieramy przydatne linki w jedno miejsce. Tylko tyle i aż tyle. Jeśli chcecie dowiedzieć się od czego zacząć poszukiwania artykułów naukowych, jeśli chcecie poznać podkasty popnaukowe, jeśli chcecie poznać ciekawe kanały na Youtube, albo dotrzeć do przydatnych źródeł z wybranych dziedzin – zajrzyjcie i przetestujcie wyszukiwarkę.\r\nLinki są zorganizowane według kategorii gatunkowo-funkcjonalnych (np. podkasty, serwisy informacyjne, strony zawierające informacje o grantach). Jest również specjalna kategoria “tematyczne/dziedzinowe”, która rozwinie dalsze okno wyboru wg dziedzin naukowych (np. lingwistyka, neuronauki). Ta z kolei pozwoli na jeszcze dokładniejsze zawężenie poszukiwań, wg tagów (dowolne hasła, lepiej kategoryzujące strony).\r\nBaza Wiedzy jest i będzie w ciągłym rozwoju, a znajdować się na niej będą ręcznie wybrane linki do istotnych stron. Zależy nam na stworzeniu prostego, funkcjonalnego przybornika do świata wiedzy. Kategorie zorganizowaliśmy tak, aby różne osoby mogły znaleźć coś przydatnego. Dla osób zaczynających poszukiwanie wiedzy stworzyliśmy kategorię “Gdzie zacząć”, na której znajdziecie odnośniki do baz z zasobami i wyszukiwarek. Dla osób szukających rozrywki i wiadomości naukowych mamy kategorie podkastów, kanałów wideo i serwisów informacyjnych. Z kolei osoby już eksplorujące wybrane dziedziny naukowe, mamy kategorię “dziedziny”, która pozwala wybrać specyficzne pole badawcze.\r\nWy też możecie dołożyć swoje trzy grosze do rozwoju Bazy Wiedzy! Jeśli znacie przydatne strony, albo jeśli macie wiedzę ekspercką z zakresu jakiejś dziedziny – piszcie do nas! Informacje w zakładce “Kontakt”.\r\n\r\np.comment {\r\nborder-left: 6px solid yellow;\r\n  background-color: lightgrey;\r\n  margin-left: 25px;\r\n  padding: 10px;\r\n  \r\n  margin-left: 25px;\r\n  border-radius: 5px;\r\n  font-style: italic;\r\n}\r\n\r\np.comment {\r\nborder-left: 6px solid yellow;\r\n  background-color: lightgrey;\r\n  margin-left: 25px;\r\n  padding: 10px;\r\n  \r\n  margin-left: 25px;\r\n  border-radius: 5px;\r\n  font-style: italic;\r\n}\r\n\r\n\r\nLorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-12-odwied-baz-wiedzy/books-1655783_1280.jpg",
    "last_modified": "2021-09-12T23:47:42+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-12-witajcie-w-sortowni/",
    "title": "Witajcie w Sortowni",
    "description": {},
    "author": [
      {
        "name": "Kamil Kopacewicz",
        "url": {}
      }
    ],
    "date": "2021-09-11",
    "categories": [
      "Sortownia"
    ],
    "contents": "\r\nOtwieramy stronę! Witajcie na Sortowni Wiedzy (a może powinniśmy powiedzieć - w Sortowni?). Ta strona ma być przede wszystkim swego rodzaju punktem przesiadkowym. Węzłem, z którego dalej można przeskoczyć do innych stron z wiedzą naukową. My w pierwszej kolejności chcemy zgromadzić przydatne odnośniki i nakierować Was na te najbardziej wartościowe. Już teraz możecie zajrzeć do naszej Bazy Wiedzy. Co prawda wciąż jeszcze panuje tam chaos, który próbujemy opanować - ale wraz z mijającym czasem, powinno zacząć się tam przejaśniać. Cel i funkcja Bazy Wiedzy są niezwykle proste. Wręcz obraźliwie proste. To po prostu baza przydatnych linków. Tyle i aż tyle. Odnośniki zebrane w jednym miejscu, opisane i podzielone na kategorie. Znajdziecie tam linki do stron popnaukowych (serwisy, blogi, podkasty), jak i linki do przydatnych repozytoriów i baz naukowych. Linki są naszym subiektywnym wyborem tego, co uważamy za przydatne i istotne. I tu otwarcie mówimy - to nie jest obiektywna selekcja, choć staramy się do obiektywizmu dążyć.\r\nZachęcamy Was do podsyłania nam nowych linków na adres sortownia.wiedzy@gmail.com. Siłą rzeczy, nie znamy się na większości dziedzin naukowych, więc będziemy niezmiernie wdzięczni za pomoc w uzupełnianiu bazy.\r\nBaza Wiedzy to jednak tylko początek. Już teraz mamy w planach kolejne moduły strony, również związane z rozpowszechnianiem nauki. Będziemy publikować teksty opiniotwórcze na blogu i poradniki (m.in. z wiedzą o tym jak korzystać z nauki, jak szukać artykułów, jak rozpoznawać strategie retoryczne itd.). Mamy tysiąc pomysłów na nowe, przydatne narzędzia do poszukiwania wiedzy naukowej – te jednak będziemy powoli i ostrożnie rozwijać, wraz z rozrastaniem się strony.\r\nDla kogo w ogóle to wszystko robimy? Jaki to ma sens? No więc tak – po pierwsze, tak zebrana wiedza jest po prostu przydatna, nawet dla nas samych. Już teraz zdarza się nam szukać linków w Bazie kiedy szukamy (tego co gdzieś tam dawno temu daliśmy do zakładek w wyszukiwarce, ale nikt nie pamięta gdzie i kiedy to było). Baza Wiedzy, nawet w swojej podstawowej formie, pozwala dość szybko znaleźć przydatne strony związane z nauką.\r\nPo drugie, ze strony mogą korzystać studen_ i naukowc_, poszukujący jakiegoś punktu wyjściowego do poszukiwań. Osoby nie zaznajomione z poszukiwaniem wiedzy naukowej znajdą u nas wiele przydatnych odnośników do najważniejszych stron, od których należy zacząć zbieranie bibliografii. Po trzecie, osoby zupełnie niezwiązane ze światem nauki mogą być zainteresowane naszym wyborem stron popnaukowych. W szczególności polecamy sekcję podkastów. Po czwarte, będziemy kierować część materiałów do influencer_ i popularyzator_ nauki. Jednym z naszych celów jest zwiększenie ilości wiedzy naukowej w debacie publicznej. W związku z tym, jeśli masz platformę i własną publiczność, na naszej stronie znajdziesz materiały, które pomogą Ci w dalszym przekazywaniu informacji naukowych.\r\nMamy nadzieję, że to co robimy będzie przydatne. To dla nas najważniejsze. Chcemy zrobić coś pozytywnego w wymiarze społecznym, nawet jeśli będzie to bardzo mała rzecz. Piszcie do nas z uwagami, pomysłami, reakcjami na adres sortownia.wiedzy@gmail.com.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-12-witajcie-w-sortowni/hero-image.jpg",
    "last_modified": "2021-09-12T20:25:56+02:00",
    "input_file": {}
  }
]
